In [1]:
# 실습01 영화 타이틀
# 1. 영화 타이틀 데이터 셋 - movws_title.csv
# 2. titles의 df 구성
# 3. df 필수 명령 8개 실행
# 4. 전체 영화는 몇 개인가?
# 5. 가장 빠른 시기에 제작된 영화 2개
# 6. 제목이 'Hamlet'인 영화는 몇 개인가?
# 7. 제목이 'Treasure Island'는 몇 개인가? 제작년도 오름차순 나열
# 8. 1950년에서 1959년 사이에 만들어진 영화는 몇 개인가?

import numpy as np
import pandas as pd
print('np ver', np.__version__)
print('pd ver', pd.__version__)

mtcsv = pd.read_csv("C:\jhpark\sync\python\db\movies_title.csv")

np ver 1.20.1
pd ver 1.2.4

In [2]:
# 2. titles df 구성
mt = pd.DataFrame(mtcsv)
mt

                          title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]

In [3]:
# 3. 필수 명령 8개
print(mt.head())
print(mt.tail())

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993
4                   The 86  2015
                      title  year
215976       Le mouton noir  1922
215977  Edge of the Unknown  2015
215978                E yue  2005
215979         Lakota Girls  2015
215980         The Sting II  1983

In [4]:
print(mt.shape)
print(mt.columns)
print(mt.info())

(215981, 2)
Index(['title', 'year'], dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215981 entries, 0 to 215980
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   215981 non-null  object
 1   year    215981 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.3+ MB
None

In [5]:
print(mt.isnull().sum())
print(mt.describe())

title    0
year     0
dtype: int64
                year
count  215981.000000
mean     1984.553822
std        29.343957
min      1894.000000
25%      1965.000000
50%      1994.000000
75%      2010.000000
max      2024.000000

In [6]:
print(mt['title'].value_counts())
print(mt['year'].value_counts())

Hamlet                         19
Carmen                         14
Macbeth                        14
The Three Musketeers           12
She                            11
                               ..
Ikaw lamang hanggang ngayon     1
Victoria of Murray Hill         1
Please Help Emily               1
Mystery of Edwin Drood          1
Intoarcerea Vlasinilor          1
Name: title, Length: 197575, dtype: int64
2015    13978
2014     8209
2013     7664
2012     7273
2011     6844
        ...
1899        2
2024        2
1903        1
1897        1
1894        1
Name: year, Length: 124, dtype: int64

In [7]:
# 4. 전체 영화 개수; 215980
mt['title'].value_counts().sum()

215981

In [8]:
# 5. 가장 빠른 시기에 제작된 영화 2개; 'Miss Jerry', 'Reproduction of the Corbett and Fitzsimmons Fight'
mt.sort_values(by='year').head(2)

                                                    title  year
165182                                         Miss Jerry  1894
85708   Reproduction of the Corbett and Fitzsimmons Fight  1897

In [9]:
# 6. 제목이 'Hamlet'인 영화는 몇 개인가? 19개
print(list(mt['title']).count('Hamlet'))
print(mt[mt['title'] =='Hamlet'].count())
mt[mt['title'] =='Hamlet']

19
title    19
year     19
dtype: int64

         title  year
5562    Hamlet  1948
26160   Hamlet  2016
37373   Hamlet  2015
42224   Hamlet  1990
43511   Hamlet  1910
68239   Hamlet  1954
85741   Hamlet  1976
87781   Hamlet  1987
87971   Hamlet  2000
91710   Hamlet  1921
114224  Hamlet  1969
154627  Hamlet  1913
163645  Hamlet  2009
169996  Hamlet  1964
186988  Hamlet  1996
192815  Hamlet  2011
195015  Hamlet  1911
205821  Hamlet  1973
207793  Hamlet  2014

In [10]:
# 7. 제목이 'Treasure Island'는 몇 개인가? 제작년도 오름차순 나열;
print(list(mt['title']).count('Treasure Island'))

ti = mt[mt['title'] =='Treasure Island']
ti.sort_values(by='year')

8

                  title  year
191379  Treasure Island  1918
47769   Treasure Island  1920
192917  Treasure Island  1934
90175   Treasure Island  1950
104714  Treasure Island  1972
103646  Treasure Island  1973
190792  Treasure Island  1985
166675  Treasure Island  1999

In [25]:
# 8. 1950년에서 1959년 사이에 만들어진 영화는 몇 개인가?

cnt = 0

for i in range(1950, 1960):
    cnt += sum(mt['year'] == i)
print(cnt)

12120

In [37]:
mt1950 = mt['year'] >= 1950
mt1959 = mt['year'] <= 1959
mt[mt1950 & mt1959]

# is_moive1 = movies_title_sample['year'] >=1950
# is_movie2 = movies_title_sample['year'] < 1960
# subset_df = movies_title_sample[is_moive1 & is_movie2 ]
# subset_df

mt1950 & mt1959

0         False
1         False
2         False
3         False
4         False
          ...
215976    False
215977    False
215978    False
215979    False
215980    False
Name: year, Length: 215981, dtype: bool